Show / Hide Table of Contents
Enum TypeSLSLimitStressCheck
Type of SLS check in extreme result
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TypeSLSLimitStressCheck
Fields
 Name |  Description
 Check_5_10_2_1_1_Tendons
check 5.10.2.1 (1) stress in tendons is used
 Check_5_10_3_2_Tendons
check 5.10.3 (2) stress in tendons is used
 Check_7_2_2_Concrete_fck
check 7.2 (2) is used
 Check_7_2_3_Concrete_fck
check 7.2 (3) is used
 Check_7_2_5_ReinforcementBars_fyk
check 7.2 (5) stress in tendons is used
 Check_7_2_5_Tendons_fpk
check 7.2 (5) stress in reinforcement bars is used
 notSet
not set value
 Improve this Doc
 View Source